In [104]:
import pandas as pd
import sqlite3
import contextlib

In [105]:
sql_connect = sqlite3.connect('../database.sqlite')
cursor = sql_connect.cursor()

Alle tabellen inladen en analyseren

In [106]:
tables = pd.read_sql("""SELECT *
                     FROM sqlite_master
                     WHERE type='table';
                     """, sql_connect)
tables

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,4,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,Player_Attributes,Player_Attributes,11,"CREATE TABLE ""Player_Attributes"" (\n\t`id`\tIN..."
2,table,Player,Player,14,CREATE TABLE `Player` (\n\t`id`\tINTEGER PRIMA...
3,table,Match,Match,18,CREATE TABLE `Match` (\n\t`id`\tINTEGER PRIMAR...
4,table,League,League,24,CREATE TABLE `League` (\n\t`id`\tINTEGER PRIMA...
5,table,Country,Country,26,CREATE TABLE `Country` (\n\t`id`\tINTEGER PRIM...
6,table,Team,Team,29,"CREATE TABLE ""Team"" (\n\t`id`\tINTEGER PRIMARY..."
7,table,Team_Attributes,Team_Attributes,2,CREATE TABLE `Team_Attributes` (\n\t`id`\tINTE...

***Beschikbare Tabellen***

- Country
- League
- Match
- Team
- Team_Attributes
- Player
- Player_Attributes

In [107]:
countries = pd.read_sql("""SELECT *
                        FROM Country;
                        """, sql_connect)
countries

       id         name
0       1      Belgium
1    1729      England
2    4769       France
3    7809      Germany
4   10257        Italy
5   13274  Netherlands
6   15722       Poland
7   17642     Portugal
8   19694     Scotland
9   21518        Spain
10  24558  Switzerland

In [108]:
leagues = pd.read_sql("""SELECT *
                      FROM League
                      JOIN Country
                      USING (id);
                      """, sql_connect)
leagues

       id  country_id                      name         name
0       1           1    Belgium Jupiler League      Belgium
1    1729        1729    England Premier League      England
2    4769        4769            France Ligue 1       France
3    7809        7809     Germany 1. Bundesliga      Germany
4   10257       10257             Italy Serie A        Italy
5   13274       13274    Netherlands Eredivisie  Netherlands
6   15722       15722        Poland Ekstraklasa       Poland
7   17642       17642  Portugal Liga ZON Sagres     Portugal
8   19694       19694   Scotland Premier League     Scotland
9   21518       21518           Spain LIGA BBVA        Spain
10  24558       24558  Switzerland Super League  Switzerland

In [109]:
matches = pd.read_sql("""SELECT *
                      FROM Match;
                      """, sql_connect)
matches.head()

,id,country_id,league_id,season,stage,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,...,SJA,VCH,VCD,VCA,GBH,GBD,GBA,BSH,BSD,BSA
0,1,1,1,2008/2009,1,2008-08-17 00:00:00,492473,9987,9993,1,...,4.00,1.65,3.40,4.50,1.78,3.25,4.00,1.73,3.40,4.20
1,2,1,1,2008/2009,1,2008-08-16 00:00:00,492474,10000,9994,0,...,3.80,2.00,3.25,3.25,1.85,3.25,3.75,1.91,3.25,3.60
2,3,1,1,2008/2009,1,2008-08-16 00:00:00,492475,9984,8635,0,...,2.50,2.35,3.25,2.65,2.50,3.20,2.50,2.30,3.20,2.75
3,4,1,1,2008/2009,1,2008-08-17 00:00:00,492476,9991,9998,5,...,7.50,1.45,3.75,6.50,1.50,3.75,5.50,1.44,3.75,6.50
4,5,1,1,2008/2009,1,2008-08-16 00:00:00,492477,7947,9985,1,...,1.73,4.50,3.40,1.65,4.50,3.50,1.65,4.75,3.30,1.67

In [110]:
teams = pd.read_sql("""SELECT *
                    FROM Team;
                    """, sql_connect)
teams.head()

   id  team_api_id  team_fifa_api_id     team_long_name team_short_name
0   1         9987             673.0           KRC Genk             GEN
1   2         9993             675.0       Beerschot AC             BAC
2   3        10000           15005.0   SV Zulte-Waregem             ZUL
3   4         9994            2007.0   Sporting Lokeren             LOK
4   5         9984            1750.0  KSV Cercle Brugge             CEB

In [111]:
team_attributes = pd.read_sql("""SELECT * 
                              FROM Team as t
                              JOIN Team_Attributes as ta  
                              USING (team_api_id);""", sql_connect)
team_attributes.head()

,id,team_api_id,team_fifa_api_id,team_long_name,team_short_name,id,team_fifa_api_id,date,buildUpPlaySpeed,buildUpPlaySpeedClass,...,chanceCreationShooting,chanceCreationShootingClass,chanceCreationPositioningClass,defencePressure,defencePressureClass,defenceAggression,defenceAggressionClass,defenceTeamWidth,defenceTeamWidthClass,defenceDefenderLineClass
0,49119,9930,434,FC Aarau,AAR,1,434,2010-02-22 00:00:00,60,Balanced,...,55,Normal,Organised,50,Medium,55,Press,45,Normal,Cover
1,49119,9930,434,FC Aarau,AAR,2,434,2014-09-19 00:00:00,52,Balanced,...,64,Normal,Organised,47,Medium,44,Press,54,Normal,Cover
2,49119,9930,434,FC Aarau,AAR,3,434,2015-09-10 00:00:00,47,Balanced,...,64,Normal,Organised,47,Medium,44,Press,54,Normal,Cover
3,39393,8485,77,Aberdeen,ABE,4,77,2010-02-22 00:00:00,70,Fast,...,70,Lots,Organised,60,Medium,70,Double,70,Wide,Cover
4,39393,8485,77,Aberdeen,ABE,5,77,2011-02-22 00:00:00,47,Balanced,...,52,Normal,Organised,47,Medium,47,Press,52,Normal,Cover

In [112]:
players = pd.read_sql("""SELECT *
                        FROM Player
                        LIMIT 5;""", sql_connect)
players

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187
1,2,155782,Aaron Cresswell,189615,1989-12-15 00:00:00,170.18,146
2,3,162549,Aaron Doran,186170,1991-05-13 00:00:00,170.18,163
3,4,30572,Aaron Galindo,140161,1982-05-08 00:00:00,182.88,198
4,5,23780,Aaron Hughes,17725,1979-11-08 00:00:00,182.88,154

In [113]:
player_attributes = pd.read_sql("""SELECT * 
                              FROM Player as p
                              JOIN Player_Attributes as pa
                              USING (player_api_id, player_fifa_api_id )
                              LIMIT 5;""", sql_connect)
player_attributes

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight,id,date,overall_rating,...,vision,penalties,marking,standing_tackle,sliding_tackle,gk_diving,gk_handling,gk_kicking,gk_positioning,gk_reflexes
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,1,2016-02-18 00:00:00,67,...,54,48,65,69,69,6,11,10,8,8
1,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,2,2015-11-19 00:00:00,67,...,54,48,65,69,69,6,11,10,8,8
2,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,3,2015-09-21 00:00:00,62,...,54,48,65,66,69,6,11,10,8,8
3,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,4,2015-03-20 00:00:00,61,...,53,47,62,63,66,5,10,9,7,7
4,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187,5,2007-02-22 00:00:00,61,...,53,47,62,63,66,5,10,9,7,7

Belangrijkste indentifiers Manchester United

Analyseren seizoen 2012/2013

In [114]:
man_u_2012_2013 = pd.read_sql("""SELECT Match.id, 
                                        Country.name AS country_name, 
                                        League.name AS league_name, 
                                        season, 
                                        stage, 
                                        date,
                                        HT.team_long_name AS  home_team,
                                        AT.team_long_name AS away_team,
                                        home_team_goal, 
                                        away_team_goal                                        
                                FROM Match
                                JOIN Country on Country.id = Match.country_id
                                JOIN League on League.id = Match.league_id
                                LEFT JOIN Team AS HT on HT.team_api_id = Match.home_team_api_id
                                LEFT JOIN Team AS AT on AT.team_api_id = Match.away_team_api_id
                                WHERE country_name = 'England'
                                AND season = "2012/2013"
                                AND (home_team = "Manchester United" 
                                        OR away_team = "Manchester United")                                
                                ORDER by date
                                LIMIT 5
                                ;""", sql_connect)
man_u_2012_2013

,id,country_name,league_name,season,stage,date,home_team,away_team,home_team_goal,away_team_goal
0,3250,England,England Premier League,2012/2013,1,2012-08-20 00:00:00,Everton,Manchester United,1,0
1,3362,England,England Premier League,2012/2013,2,2012-08-25 00:00:00,Manchester United,Fulham,3,2
2,3473,England,England Premier League,2012/2013,3,2012-09-02 00:00:00,Southampton,Manchester United,2,3
3,3573,England,England Premier League,2012/2013,4,2012-09-15 00:00:00,Manchester United,Wigan Athletic,4,0
4,3580,England,England Premier League,2012/2013,5,2012-09-23 00:00:00,Liverpool,Manchester United,1,2

In [115]:
prem_2012_2013 = pd.read_sql("""SELECT Match.id, 
                                        Country.name AS country_name, 
                                        League.name AS league_name, 
                                        season, 
                                        stage, 
                                        date,
                                        HT.team_long_name AS  home_team,
                                        AT.team_long_name AS away_team,
                                        home_team_goal, 
                                        away_team_goal                                        
                                FROM Match
                                JOIN Country on Country.id = Match.country_id
                                JOIN League on League.id = Match.league_id
                                LEFT JOIN Team AS HT on HT.team_api_id = Match.home_team_api_id
                                LEFT JOIN Team AS AT on AT.team_api_id = Match.away_team_api_id
                                WHERE country_name = 'England'
                                AND season = "2012/2013"                                
                                ORDER by date;""", sql_connect)
prem_2012_2013

,id,country_name,league_name,season,stage,date,home_team,away_team,home_team_goal,away_team_goal
0,3249,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Arsenal,Sunderland,0,0
1,3251,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Fulham,Norwich City,5,0
2,3253,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Newcastle United,Tottenham Hotspur,2,1
3,3254,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Queens Park Rangers,Swansea City,0,5
4,3255,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Reading,Stoke City,1,1
...,...,...,...,...,...,...,...,...,...,...
375,3564,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,Swansea City,Fulham,0,3
376,3565,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,Tottenham Hotspur,Sunderland,1,0
377,3566,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,West Bromwich Albion,Manchester United,5,5
378,3567,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,West Ham United,Reading,4,2
379,3568,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,Wigan Athletic,Aston Villa,2,2

In [116]:
def unique_teams(df):
    teams_dict = []
    unique_team = df["home_team"].unique()
    for team in unique_team:
        teams_dict.append(team)
    
    return teams_dict

prem_12_13_teams = unique_teams(prem_2012_2013)
prem_12_13_teams

['Arsenal',
 'Fulham',
 'Newcastle United',
 'Queens Park Rangers',
 'Reading',
 'West Bromwich Albion',
 'West Ham United',
 'Manchester City',
 'Wigan Athletic',
 'Everton',
 'Chelsea',
 'Aston Villa',
 'Manchester United',
 'Norwich City',
 'Southampton',
 'Swansea City',
 'Tottenham Hotspur',
 'Liverpool',
 'Stoke City',
 'Sunderland']

In [117]:
# 
def decide_winner(home_team_goal, away_team_goal):
    if home_team_goal > away_team_goal:
        return 'Win'
    elif home_team_goal == away_team_goal:
        return 'Draw'
    else:
        return 'Loss'

In [118]:
test_results = [
    ("Arsenal", "Liverpool", 2, 1),
    ("Manchester United", "Tottenham Hotspur", 1, 1),
    ("Liverpool", "Manchester United", 0, 1)
]

teams_thuis = []
teams_uit = []
thuis_doelpunten = []
uit_doelpunten = []
uitkomst_thuis = []
uitkomst_uit = []

for wedstrijd in test_results:
    thuis, uit, doelpunten_thuis, doelpunten_uit = wedstrijd
    teams_thuis.extend([thuis, uit])
    teams_uit.extend([uit, thuis]) 
    thuis_doelpunten.extend([doelpunten_thuis, doelpunten_uit])
    uit_doelpunten.extend([doelpunten_uit, doelpunten_thuis])
    uitkomst_thuis.extend([decide_winner(doelpunten_thuis, doelpunten_uit)] * 2)
    uitkomst_uit.extend([decide_winner(doelpunten_uit, doelpunten_thuis)] * 2)

df = pd.DataFrame({
    'Thuisteam': teams_thuis,
    'Uitteam': teams_uit,
    'Thuisteam_doelpunten': thuis_doelpunten,
    'Uitteam_doelpunten': uit_doelpunten,
    'Uitkomst_thuisteam': uitkomst_thuis,
    'Uitkomst_uitteam': uitkomst_uit
})

display(df)

,Thuisteam,Uitteam,Thuisteam_doelpunten,Uitteam_doelpunten,Uitkomst_thuisteam,Uitkomst_uitteam
0,Arsenal,Liverpool,2,1,Win,Loss
1,Liverpool,Arsenal,1,2,Win,Loss
2,Manchester United,Tottenham Hotspur,1,1,Draw,Draw
3,Tottenham Hotspur,Manchester United,1,1,Draw,Draw
4,Liverpool,Manchester United,0,1,Loss,Win
5,Manchester United,Liverpool,1,0,Loss,Win

In [119]:
prem_2012_2013

,id,country_name,league_name,season,stage,date,home_team,away_team,home_team_goal,away_team_goal
0,3249,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Arsenal,Sunderland,0,0
1,3251,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Fulham,Norwich City,5,0
2,3253,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Newcastle United,Tottenham Hotspur,2,1
3,3254,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Queens Park Rangers,Swansea City,0,5
4,3255,England,England Premier League,2012/2013,1,2012-08-18 00:00:00,Reading,Stoke City,1,1
...,...,...,...,...,...,...,...,...,...,...
375,3564,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,Swansea City,Fulham,0,3
376,3565,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,Tottenham Hotspur,Sunderland,1,0
377,3566,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,West Bromwich Albion,Manchester United,5,5
378,3567,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,West Ham United,Reading,4,2
379,3568,England,England Premier League,2012/2013,38,2013-05-19 00:00:00,Wigan Athletic,Aston Villa,2,2

In [120]:
goals_per_match = prem_2012_2013[["home_team", "away_team", "home_team_goal", "away_team_goal"]]
goals_per_match

                home_team          away_team  home_team_goal  away_team_goal
0                 Arsenal         Sunderland               0               0
1                  Fulham       Norwich City               5               0
2        Newcastle United  Tottenham Hotspur               2               1
3     Queens Park Rangers       Swansea City               0               5
4                 Reading         Stoke City               1               1
..                    ...                ...             ...             ...
375          Swansea City             Fulham               0               3
376     Tottenham Hotspur         Sunderland               1               0
377  West Bromwich Albion  Manchester United               5               5
378       West Ham United            Reading               4               2
379        Wigan Athletic        Aston Villa               2               2

[380 rows x 4 columns]

In [121]:
def season_results(df):
    result_hometeam = []
    result_awayteam = []

    for index, col in df.iterrows():
        goals_thuis = col['home_team_goal']
        goals_uit = col['away_team_goal']
        
        result_hometeam.append(decide_winner(goals_thuis, goals_uit))
        result_awayteam.append(decide_winner(goals_uit, goals_thuis))

    win_loss_df = pd.DataFrame({
        'Thuisteam': df['home_team'],
        'Uitteam': df['away_team'],
        'Thuisteam_doelpunten': df['home_team_goal'],
        'Uitteam_doelpunten': df['away_team_goal'],
        'Uitkomst_thuisteam': result_hometeam,
        'Uitkomst_uitteam': result_awayteam
    })

    return win_loss_df

season_results(goals_per_match)

,Thuisteam,Uitteam,Thuisteam_doelpunten,Uitteam_doelpunten,Uitkomst_thuisteam,Uitkomst_uitteam
0,Arsenal,Sunderland,0,0,Draw,Draw
1,Fulham,Norwich City,5,0,Win,Loss
2,Newcastle United,Tottenham Hotspur,2,1,Win,Loss
3,Queens Park Rangers,Swansea City,0,5,Loss,Win
4,Reading,Stoke City,1,1,Draw,Draw
...,...,...,...,...,...,...
375,Swansea City,Fulham,0,3,Loss,Win
376,Tottenham Hotspur,Sunderland,1,0,Win,Loss
377,West Bromwich Albion,Manchester United,5,5,Draw,Draw
378,West Ham United,Reading,4,2,Win,Loss
379,Wigan Athletic,Aston Villa,2,2,Draw,Draw